saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/GigaDevice.GD32E10x_DFP.1.0.2.pdsc
        <!-- *************************  Device 'GD32E103TB'  ***************************** -->
        <device Dname="GD32E103TB">
          <memory    id="IROM1"                   start="0x08000000" size="0x020000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E10x.FLM" start="0x08000000" size="0x01000" default="1"/>
          <compile header="Device/Include/gd32e10x.h" define="GD32E10x"/>
          <debug svd="SVD/GD32E10x.svd"/>
        </device>

       <!-- *************************  Device 'GD32E103C8'  ***************************** -->
        <device Dname="GD32E103C8">
          <memory    id="IROM1"                   start="0x08000000" size="0x010000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x05000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E10x.FLM" start="0x08000000" size="0x01000" default="1"/>
          <compile header="Device/Include/gd32e10x.h" define="GD32E10x"/>
          <debug svd="SVD/GD32E10x.svd"/>
        </device>
      
        <!-- *************************  Device 'GD32E103CB'  ***************************** -->
        <device Dname="GD32E103CB">
          <memory    id="IROM1"                   start="0x08000000" size="0x020000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E10x.FLM" start="0x08000000" size="0x01000" default="1"/>
          <compile header="Device/Include/gd32e10x.h" define="GD32E10x"/>
          <debug svd="SVD/GD32E10x.svd"/>
        </device>

       <!-- *************************  Device 'GD32E103R8'  ***************************** -->
        <device Dname="GD32E103R8">
          <memory    id="IROM1"                   start="0x08000000" size="0x010000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x05000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E10x.FLM" start="0x08000000" size="0x01000" default="1"/>
          <compile header="Device/Include/gd32e10x.h" define="GD32E10x"/>
          <debug svd="SVD/GD32E10x.svd"/>
        </device>
      
        <!-- *************************  Device 'GD32E103RB'  ***************************** -->
        <device Dname="GD32E103RB">
          <memory    id="IROM1"                   start="0x08000000" size="0x020000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E10x.FLM" start="0x08000000" size="0x01000" default="1"/>
          <compile header="Device/Include/gd32e10x.h" define="GD32E10x"/>
          <debug svd="SVD/GD32E10x.svd"/>
        </device>

      <!-- *************************  Device 'GD32E103V8'  ***************************** -->
        <device Dname="GD32E103V8">
          <memory    id="IROM1"                   start="0x08000000" size="0x010000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x05000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E10x.FLM" start="0x08000000" size="0x01000" default="1"/>
          <compile header="Device/Include/gd32e10x.h" define="GD32E10x  "/>
          <debug svd="SVD/GD32E10x.svd"/>
        </device>
      
        <!-- *************************  Device 'GD32E103VB'  ***************************** -->
        <device Dname="GD32E103VB">
          <memory    id="IROM1"                   start="0x08000000" size="0x020000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32E10x.FLM" start="0x08000000" size="0x01000" default="1"/>
          <compile header="Device/Include/gd32e10x.h" define="GD32E10x "/>
          <debug svd="SVD/GD32E10x.svd"/>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
 

    <!-- Device Conditions -->
    <condition id="GD32E10x">
      <description>GigaDevice GD32E10x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32E103*[8B]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

   <!-- Device + CMSIS Conditions -->
    <condition id="GD32E10x CMSIS">
      <description>GigaDevice GD32E10x Devices and CMSIS-CORE</description>
      <accept condition="GD32E10x"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GD32E10x_libopt"/>    
      <require Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="RCU"/>           
      <require Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="PMU"/>    
    </condition>

    <!-- GD32E10x STDPERIPHERALS RCU Conditions -->
    <condition id="GD32E10x STDPERIPHERALS RCU">
      <description>GigaDevice  GD32E10x Standard Peripherals Drivers with RCU</description>
      <require condition="GD32E10x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="RCU"/>
    </condition>

     <!-- GD32E10x STDPERIPHERALS MISC Conditions -->
    <condition id="GD32E10x STDPERIPHERALS MISC">
      <description>GigaDevice  GD32E10x Standard Peripherals Drivers with MISC</description>
      <require condition="GD32E10x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="MISC"/>
    </condition>

     <!-- GD32E10x STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32E10x STDPERIPHERALS EVAL">
      <description>GigaDevice  GD32E10x Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32E10x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="USART"/>
    </condition>
