saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/GigaDevice.GD32E10x_DFP.1.0.2.pdsc
  </conditions>

  <components>
    <!-- GD32E10x_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="ADC" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_adc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_adc.c" attr="config" version="1.0.2" />
        </files>
    </component>

   <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="BKP" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Backup register(BKP) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_BKP
        </RTE_Components_h>
        <files>
          <!-- BKP flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_bkp.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_bkp.c" attr="config" version="1.0.2" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="CAN" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Controller Area Network (CAN) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
        <files>
          <!-- CAN flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_can.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_can.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="CRC" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_crc.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="CTC" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Clock trim controller (CTC) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CTC
        </RTE_Components_h>
        <files>
          <!-- CTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_ctc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_ctc.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="DAC" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Digital-to-analog converter (DAC) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_dac.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_dac.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="DBG" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- DBG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_dbg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_dbg.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="DMA" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_dma.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="EXMC" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>External memory controller(EXMC) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXMC
        </RTE_Components_h>
        <files>
          <!-- EXMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_exmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_exmc.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="EXTI" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_exti.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_exti.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="FMC" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_fmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_fmc.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="FWDGT" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Free watchdog timer(FWDGT) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
        <files>
          <!-- FWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_fwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_fwdgt.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="GPIO" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_gpio.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="I2C" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_i2c.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="MISC" Cversion="1.0.2" condition="GD32E10x CMSIS">
      <description>MISC driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_misc.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="PMU" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_pmu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_pmu.c" attr="config" version="1.0.2" />
        </files>
    </component>

