saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/GigaDevice.GD32E10x_DFP.1.0.2.pdsc
  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="RCU" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
        <files>
          <!-- RCU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_rcu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_rcu.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="RTC" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_rtc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_rtc.c" attr="config" version="1.0.2" />
        </files>
    </component>


  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="SPI_I2S" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_spi.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="TIMER" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>TIMER driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_timer.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_timer.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="USART" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_usart.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32E10x_StdPeripherals" Csub="WWDGT" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32E10x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32e10x_wwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32e10x_wwdgt.c" attr="config" version="1.0.2" />
        </files>
    </component>

    <!-- Utilities GD32E10x -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32E10x" Cversion="1.0.2" condition="GD32E10x STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32e10x_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32e10x_eval.c" attr="config" version="1.0.2"/>
      </files>
    </component>

    <!-- Config GD32E10x -->
    <component Cclass="Device" Cgroup="GD32E10x_libopt" Cversion="1.0.2" condition="GD32E10x CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/gd32e10x_libopt.h"/>
      </files>
    </component>

   <!-- Startup GD32E10x  -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="1.0.2" condition="GD32E10x">
      <description>System Startup for GigaDevice GD32E10x  Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32e10x.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32e10x.s" attr="config" version="1.0.2" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32e10x.c"      attr="config" version="1.0.2"/>
      </files>
    </component>
  </components>

</package>
